In [1]:
import numpy as np
import pandas as pd

from env import get_db_url

In [2]:
telco_url = get_db_url("telco_churn")

In [3]:
telco_query = """
SELECT c.customer_id, c.monthly_charges, c.tenure, c.total_charges
FROM customers AS c
JOIN contract_types AS ct USING(contract_type_id)
WHERE ct.contract_type = 'Two year'"""

In [4]:
customers = pd.read_sql(telco_query, telco_url)
customers

     customer_id  monthly_charges  tenure total_charges
0     0013-SMEOE           109.70      71       7904.25
1     0014-BMAQU            84.65      63        5377.8
2     0016-QLJIS            90.45      65        5957.9
3     0017-DINOC            45.20      54       2460.55
4     0017-IUDMW           116.80      72       8456.75
...          ...              ...     ...           ...
1690  9964-WBQDJ            24.40      71        1725.4
1691  9972-EWRJS            19.25      67        1372.9
1692  9975-GPKZU            19.75      46         856.5
1693  9993-LHIEB            67.85      67       4627.65
1694  9995-HOTOH            59.00      63        3707.6

[1695 rows x 4 columns]

In [5]:
customers.head()

  customer_id  monthly_charges  tenure total_charges
0  0013-SMEOE           109.70      71       7904.25
1  0014-BMAQU            84.65      63        5377.8
2  0016-QLJIS            90.45      65        5957.9
3  0017-DINOC            45.20      54       2460.55
4  0017-IUDMW           116.80      72       8456.75

In [6]:
customers.shape

(1695, 4)

In [7]:
customers.describe()

       monthly_charges       tenure
count      1695.000000  1695.000000
mean         60.770413    56.735103
std          34.678865    18.209363
min          18.400000     0.000000
25%          24.025000    48.000000
50%          64.350000    64.000000
75%          90.450000    71.000000
max         118.750000    72.000000

In [8]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
tenure             1695 non-null int64
total_charges      1695 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [9]:
customers.isnull().sum()

customer_id        0
monthly_charges    0
tenure             0
total_charges      0
dtype: int64

In [10]:
customers.total_charges.value_counts()

           10
5714.2      2
5682.25     2
3533.6      2
1161.75     2
           ..
7159.7      1
7679.65     1
223.15      1
1445.2      1
8672.45     1
Name: total_charges, Length: 1678, dtype: int64

In [11]:
customers.total_charges.max()

'987.95'

In [12]:
customers.total_charges.min()

' '

In [13]:
customers.total_charges = customers.total_charges.str.strip()
customers = customers.replace("", np.nan)
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
tenure             1695 non-null int64
total_charges      1685 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [14]:
customers.total_charges.value_counts()

5714.2     2
1161.75    2
1110.05    2
343.45     2
844.45     2
          ..
7159.7     1
7679.65    1
223.15     1
1445.2     1
8672.45    1
Name: total_charges, Length: 1677, dtype: int64

In [24]:
customers.dropna?

In [ ]:
.dropna

In [15]:
df = customers.dropna()
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
monthly_charges    1685 non-null float64
tenure             1685 non-null int64
total_charges      1685 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 65.8+ KB

In [16]:
df["total_charges"] = df.total_charges.astype("float")

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
monthly_charges    1685 non-null float64
tenure             1685 non-null int64
total_charges      1685 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB

In [18]:
df.describe()

       monthly_charges      tenure  total_charges
count      1685.000000  1685.00000    1685.000000
mean         60.872374    57.07181    3728.933947
std          34.712210    17.72913    2571.252806
min          18.400000     1.00000      20.350000
25%          24.050000    48.00000    1278.800000
50%          64.450000    64.00000    3623.950000
75%          90.550000    71.00000    5999.850000
max         118.750000    72.00000    8672.450000